#+title: An Introduction to Predicting Recessions
#+author: Matt Brigida, Ph.D.
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+PROPERTY: header-args
#+bibliography: references.bib

* Overview

We'll use the methods in this paper [cite:@estrella2006yield;] to predict recession via the yield curve.  The model uses a long minus short-term interest rate spread as the single input variable.  The spread is calculated using Treasury yields and is the 10 year minus the 3 month.  We'll pull Treasury yields via the FRED API.  The API codes are:

|---------+-------|
| 10 year | GS10  |
| 3 month | TB3MS |
|---------+-------|


#+begin_src python :session *rec* :results none :exports code
import pandas as pd
from fredapi import Fred
from scipy import stats
#+end_src

* Implementation

** Data Preparation

The code below gathers the data.

#+name: get_data
#+begin_src python :session *rec* :results values :exports both :cache true :eval no
key = pd.read_table("~/fred_api_key_pythoninfinance.txt")
key = str(key.columns.values[0])
fred = Fred(api_key=key)
ten_yr = fred.get_series('GS10')
three_mo = fred.get_series('TB3MS')
data = pd.concat([ten_yr, three_mo], axis=1, join='inner')
data.columns = ['long', 'short']
data
#+end_src

#+RESULTS: get_data
#+begin_example
            long  short
1953-04-01  2.83   2.19
1953-05-01  3.05   2.16
1953-06-01  3.11   2.11
1953-07-01  2.93   2.04
1953-08-01  2.95   2.04
...          ...    ...
2023-01-01  3.53   4.54
2023-02-01  3.75   4.65
2023-03-01  3.66   4.69
2023-04-01  3.46   4.92
2023-05-01  3.57   5.14

[842 rows x 2 columns]
#+end_example

#+begin_src python :session *rec* :eval no
data.to_csv("treasury_data.csv")
#+end_src


#+begin_src python :session *rec*
data = pd.read_csv("treasury_data.csv", index_col=0)
#+end_src

#+RESULTS:

** Model

The predictive model is in a simple probit form:

$$P(R_{t+12}) = F(\alpha + \beta S_t)$$

where:

- $F$ denotes the cumulative normal distribution function.
- $S_t$ is the spread between short and long term interest rates at time /t/.
- $\alpha$ and $\beta$ are estimated parameters.

[cite:@estrella2006yield;] estimated $\alpha$ and $\beta$ to be -0.6045 and -0.7374 respectively. 

#+begin_src python :session *rec* :results values :exports both :cache true
rec_prob = stats.norm.cdf(-0.6045 - 0.7374 * (data["long"] - data["short"]))
rec_prob
#+end_src

#+RESULTS:
| 0.140866155 | 0.10369298 | 0.0898142109 | 0.10369298 | 0.101060149 | 0.0806231857 | 0.0607663793 | 0.0643968556 | 0.0910157659 | 0.0590121861 | 0.0435774895 | 0.055623181 | 0.0572979689 | 0.0365893954 | 0.0295414473 | 0.0383975663 | 0.0478212645 | 0.0531837223 | 0.0470918375 | 0.0402779222 | 0.0539872712 | 0.0516050881 | 0.0449569559 | 0.0508298627 | 0.0721609786 | 0.0581501146 | 0.0531837223 | 0.0590121861 | 0.0817316029 | 0.102370409 | 0.139224525 | 0.139224525 | 0.180303781 | 0.167065628 | 0.161589058 | 0.129648557 | 0.150991091 | 0.172660465 | 0.163401431 | 0.116156859 | 0.126560404 | 0.15800378 | 0.176455945 | 0.165226955 | 0.188155991 | 0.194181465 | 0.217261293 | 0.198262985 | 0.182247294 | 0.15800378 | 0.163401431 | 0.120538717 | 0.15447113 | 0.186173419 | 0.186173419 | 0.182247294 | 0.232738494 | 0.139224525 | 0.0422323882 | 0.0326402759 | 0.0290495131 | 0.0184588065 | 0.0145349987 | 0.0109198004 | 0.0244943502 | 0.0572979689 | 0.0711529422 | 0.0817316029 | 0.0795261597 | 0.068193666 | 0.0625610902 | 0.0691693492 | 0.0711529422 | 0.0456597543 | 0.0752507974 | 0.068193666 | 0.0839828396 | 0.140866155 | 0.168917442 | 0.188155991 | 0.226031543 | 0.190151539 | 0.159789841 | 0.0972027848 | 0.0839828396 | 0.0828514686 | 0.0321059302 | 0.0371842171 | 0.0435774895 | 0.0572979689 | 0.037786917 | 0.0396429975 | 0.037786917 | 0.0371842171 | 0.0539872712 | 0.0548004009 | 0.0442628914 | 0.0493072441 | 0.0402779222 | 0.0326402759 | 0.0342874705 | 0.0315788273 | 0.0360023808 | 0.0463713578 | 0.0463713578 | 0.0539872712 | 0.0581501146 | 0.0672286398 | 0.0773660484 | 0.0701557534 | 0.0701557534 | 0.0795261597 | 0.0721609786 | 0.068193666 | 0.0691693492 | 0.0795261597 | 0.0910157659 | 0.0997621549 | 0.0898142109 | 0.0851257719 | 0.0817316029 | 0.0898142109 | 0.0898142109 | 0.110491959 | 0.134377976 | 0.131212049 | 0.137595963 | 0.147563626 | 0.145869591 | 0.139224525 | 0.144188674 | 0.134377976 | 0.122024879 | 0.128098017 | 0.132788515 | 0.126560404 | 0.132788515 | 0.135980453 | 0.144188674 | 0.163401431 | 0.19621579 | 0.188155991 | 0.208690875 | 0.208690875 | 0.210814589 | 0.200323018 | 0.182247294 | 0.192160039 | 0.182247294 | 0.190151539 | 0.200323018 | 0.192160039 | 0.217261293 | 0.267876498 | 0.230490638 | 0.208690875 | 0.241850631 | 0.239554608 | 0.202395859 | 0.221621626 | 0.212950925 | 0.321182744 | 0.361750383 | 0.313300682 | 0.302923014 | 0.308092669 | 0.255874102 | 0.208690875 | 0.123523862 | 0.0634738078 | 0.0449569559 | 0.0959413163 | 0.0886244868 | 0.105027903 | 0.0997621549 | 0.0874465412 | 0.126560404 | 0.159789841 | 0.150991091 | 0.152724536 | 0.212950925 | 0.223820411 | 0.226031543 | 0.22825497 | 0.198262985 | 0.210814589 | 0.219435237 | 0.215099841 | 0.255874102 | 0.297792551 | 0.255874102 | 0.208690875 | 0.25825193 | 0.208690875 | 0.241850631 | 0.345304773 | 0.348026502 | 0.255874102 | 0.248809767 | 0.297792551 | 0.315918806 | 0.29270209 | 0.246478275 | 0.176455945 | 0.105027903 | 0.0817316029 | 0.0721609786 | 0.0886244868 | 0.0763028452 | 0.0616586364 | 0.0493072441 | 0.0396429975 | 0.0422323882 | 0.0266908633 | 0.00861800931 | 0.0102991349 | 0.0198345535 | 0.011797825 | 0.0280860543 | 0.0564556806 | 0.0348514891 | 0.0470918375 | 0.0456597543 | 0.037786917 | 0.0216757248 | 0.00621636433 | 0.00318393342 | 0.00990265274 | 0.00748194118 | 0.00811380025 | 0.0129809903 | 0.0148089893 | 0.0132295579 | 0.0228482494 | 0.0295414473 | 0.0435774895 | 0.0598842517 | 0.0839828396 | 0.0851257719 | 0.144188674 | 0.182247294 | 0.167065628 | 0.348026502 | 0.517712002 | 0.630054615 | 0.61040701 | 0.38689614 | 0.581854491 | 0.467742449 | 0.488301498 | 0.313300682 | 0.479483472 | 0.500067022 | 0.450186567 | 0.367291305 | 0.212950925 | 0.529458205 | 0.277678464 | 0.176455945 | 0.223820411 | 0.208690875 | 0.0643968556 | 0.0228482494 | 0.0120266757 | 0.00559852901 | 0.00355825995 | 0.00689383919 | 0.021296357 | 0.0201917806 | 0.0184588065 | 0.013482227 | 0.00621636433 | 0.00634694003 | 0.00325583321 | 0.00297672738 | 0.00442750096 | 0.00472294501 | 0.00472294501 | 0.0079515894 | 0.00583879925 | 0.00548171945 | 0.00703690403 | 0.00733091512 | 0.00661539459 | 0.00689383919 | 0.00596233045 | 0.00452409475 | 0.00332919012 | 0.00355825995 | 0.00718258278 | 0.0115727626 | 0.0145349987 | 0.0220607866 | 0.0415725461 | 0.0539872712 | 0.0449569559 | 0.0360023808 | 0.0422323882 | 0.0383975663 | 0.0290495131 | 0.0240737645 | 0.0209226193 | 0.0300402766 | 0.0354231023 | 0.0564556806 | 0.152724536 | 0.139224525 | 0.232738494 | 0.290172107 | 0.337187939 | 0.329146195 | 0.367291305 | 0.345304773 | 0.367291305 | 0.310691934 | 0.348026502 | 0.403935304 | 0.532391156 | 0.665623475 | 0.59333643 | 0.729800587 | 0.61040701 | 0.392553449 | 0.885343418 | 0.748954073 | 0.0371842171 | 0.00462256576 | 0.0132295579 | 0.0198345535 | 0.0643968556 | 0.241850631 | 0.56740449 | 0.911429443 | 0.885343418 | 0.717469313 | 0.334498854 | 0.27521163 | 0.845608741 | 0.62726717 | 0.456029423 | 0.42693534 | 0.144188674 | 0.0365893954 | 0.00675334899 | 0.00325583321 | 0.0105025164 | 0.0959413163 | 0.0701557534 | 0.0711529422 | 0.0415725461 | 0.0253540384 | 0.00583879925 | 6.29581171e-05 | 5.58164895e-05 | 0.00151745353 | 0.00748194118 | 0.00583879925 | 0.00583879925 | 0.00571754393 | 0.0140000848 | 0.0132295579 | 0.0132295579 | 0.0168541463 | 0.0107093888 | 0.00703690403 | 0.00525457831 | 0.0030444051 | 0.00284542441 | 0.00355825995 | 0.00405929109 | 0.00423982289 | 0.00380138169 | 0.00278175201 | 0.000588508212 | 0.000441291003 | 0.00137819241 | 0.011797825 | 0.0142653823 | 0.00844696725 | 0.00265824996 | 0.000841411851 | 0.000530393236 | 0.00137819241 | 0.00107959068 | 0.000760486176 | 0.0010023403 | 0.00148148381 | 0.00141186815 | 0.00155421813 | 0.00128151973 | 0.00201571439 | 0.00661539459 | 0.0140000848 | 0.0150874101 | 0.0348514891 | 0.066274206 | 0.0643968556 | 0.0396429975 | 0.037786917 | 0.0456597543 | 0.0348514891 | 0.0120266757 | 0.011797825 | 0.0224516066 | 0.0383975663 | 0.0342874705 | 0.0337309757 | 0.0337309757 | 0.00914949451 | 0.00271936811 | 0.00442750096 | 0.00414867849 | 0.00452409475 | 0.00231688837 | 0.000953694275 | 0.00163019427 | 0.0014462937 | 0.00332919012 | 0.0064799376 | 0.00503584836 | 0.00371873497 | 0.00355825995 | 0.00779223711 | 0.0100991962 | 0.0129809903 | 0.0295414473 | 0.0470918375 | 0.068193666 | 0.0851257719 | 0.113299154 | 0.140866155 | 0.15800378 | 0.159789841 | 0.178373326 | 0.241850631 | 0.239554608 | 0.223820411 | 0.176455945 | 0.190151539 | 0.230490638 | 0.223820411 | 0.152724536 | 0.126560404 | 0.132788515 | 0.0874465412 | 0.0874465412 | 0.123523862 | 0.10910721 | 0.0590121861 | 0.0415725461 | 0.0402779222 | 0.0564556806 | 0.055623181 | 0.023659263 | 0.0220607866 | 0.0129809903 | 0.00896922867 | 0.00571754393 | 0.00462256576 | 0.00482526392 | 0.00621636433 | 0.00827891195 | 0.00661539459 | 0.00332919012 | 0.00231688837 | 0.00141186815 | 0.000722770265 | 0.000722770265 | 0.000396822054 | 0.000366240105 | 0.000558752535 | 0.000516718498 | 0.000800007564 | 0.000704565927 | 0.000396822054 | 0.000386374118 | 0.000635896136 | 0.000558752535 | 0.00110652977 | 0.0022640204 | 0.0019235148 | 0.00201571439 | 0.00311346564 | 0.00405929109 | 0.00514417869 | 0.00861800931 | 0.0105025164 | 0.00559852901 | 0.00462256576 | 0.00405929109 | 0.00452409475 | 0.00253972153 | 0.00122056 | 0.00221224763 | 0.00265824996 | 0.00259837513 | 0.00414867849 | 0.0034803775 | 0.00388567123 | 0.00503584836 | 0.012736471 | 0.0165479491 | 0.0315788273 | 0.0456597543 | 0.0500639382 | 0.094691929 | 0.131212049 | 0.107734978 | 0.0795261597 | 0.0997621549 | 0.122024879 | 0.152724536 | 0.152724536 | 0.139224525 | 0.0922292034 | 0.0581501146 | 0.0396429975 | 0.0305460701 | 0.0257932741 | 0.0305460701 | 0.037786917 | 0.0295414473 | 0.0409210813 | 0.0711529422 | 0.0516050881 | 0.0402779222 | 0.0500639382 | 0.0402779222 | 0.0300402766 | 0.0337309757 | 0.0396429975 | 0.0711529422 | 0.0721609786 | 0.0625610902 | 0.0828514686 | 0.125035695 | 0.139224525 | 0.165226955 | 0.168917442 | 0.144188674 | 0.132788515 | 0.139224525 | 0.161589058 | 0.165226955 | 0.176455945 | 0.226031543 | 0.152724536 | 0.180303781 | 0.212950925 | 0.188155991 | 0.15447113 | 0.117604738 | 0.10369298 | 0.0851257719 | 0.0564556806 | 0.0643968556 | 0.066274206 | 0.0643968556 | 0.0634738078 | 0.094691929 | 0.0806231857 | 0.055623181 | 0.0934545744 | 0.152724536 | 0.198262985 | 0.139224525 | 0.182247294 | 0.251152949 | 0.339885368 | 0.323828335 | 0.370072249 | 0.392553449 | 0.415399084 | 0.270310562 | 0.221621626 | 0.170782391 | 0.0616586364 | 0.0280860543 | 0.0271493516 | 0.0300402766 | 0.0365893954 | 0.0159498178 | 0.00861800931 | 0.00397163158 | 0.000930193144 | 0.000953694275 | 0.00155421813 | 0.000741407266 | 0.000722770265 | 0.000862845053 | 0.00141186815 | 0.00259837513 | 0.00536708063 | 0.0120266757 | 0.00951956323 | 0.00363770347 | 0.0034803775 | 0.00318393342 | 0.00442750096 | 0.0049295543 | 0.00355825995 | 0.00718258278 | 0.00861800931 | 0.00201571439 | 0.000722770265 | 0.00110652977 | 0.0010023403 | 0.0010023403 | 0.0010023403 | 0.00128151973 | 0.00170953949 | 0.00311346564 | 0.000907225112 | 0.000429760028 | 0.000800007564 | 0.00163019427 | 0.00380138169 | 0.00748194118 | 0.00990265274 | 0.0150874101 | 0.017481097 | 0.0228482494 | 0.0354231023 | 0.028564405 | 0.0396429975 | 0.0590121861 | 0.0862803209 | 0.094691929 | 0.113299154 | 0.119065347 | 0.123523862 | 0.137595963 | 0.150991091 | 0.230490638 | 0.239554608 | 0.223820411 | 0.186173419 | 0.186173419 | 0.200323018 | 0.239554608 | 0.29270209 | 0.295242271 | 0.321182744 | 0.361750383 | 0.348026502 | 0.329146195 | 0.35349339 | 0.372860002 | 0.318546197 | 0.267876498 | 0.167065628 | 0.230490638 | 0.170782391 | 0.142520867 | 0.142520867 | 0.105027903 | 0.0784404668 | 0.0910157659 | 0.0360023808 | 0.011797825 | 0.00896922867 | 0.0142653823 | 0.0120266757 | 0.00914949451 | 0.0137390512 | 0.00634694003 | 0.00175051639 | 0.00107959068 | 0.00896922867 | 0.00896922867 | 0.00621636433 | 0.00571754393 | 0.00405929109 | 0.00187886686 | 0.000652458949 | 0.000977739574 | 0.000884779309 | 0.00125070014 | 0.00113408364 | 0.00105325409 | 0.000652458949 | 0.000465218181 | 0.000588508212 | 0.000588508212 | 0.000441291003 | 0.00131303238 | 0.00201571439 | 0.00340402961 | 0.00661539459 | 0.00718258278 | 0.00861800931 | 0.00559852901 | 0.00170953949 | 0.00137819241 | 0.000820469396 | 0.00116226479 | 0.000930193144 | 0.00179238514 | 0.00265824996 | 0.00265824996 | 0.0111338003 | 0.0198345535 | 0.0148089893 | 0.0187948926 | 0.0198345535 | 0.0209226193 | 0.0232507798 | 0.0159498178 | 0.0198345535 | 0.0310588971 | 0.0415725461 | 0.0485597097 | 0.0383975663 | 0.0365893954 | 0.0342874705 | 0.0396429975 | 0.0342874705 | 0.024921086 | 0.0232507798 | 0.023659263 | 0.0315788273 | 0.0228482494 | 0.011797825 | 0.00661539459 | 0.00472294501 | 0.00388567123 | 0.00621636433 | 0.00525457831 | 0.00355825995 | 0.00363770347 | 0.00514417869 | 0.00503584836 | 0.0049295543 | 0.00675334899 | 0.00634694003 | 0.00703690403 | 0.00896922867 | 0.00703690403 | 0.0111338003 | 0.0105025164 | 0.013482227 | 0.0244943502 | 0.0201917806 | 0.0184588065 | 0.0216757248 | 0.013482227 | 0.00990265274 | 0.0109198004 | 0.0156577675 | 0.0142653823 | 0.0171651759 | 0.0145349987 | 0.0184588065 | 0.0253540384 | 0.0456597543 | 0.0371842171 | 0.0383975663 | 0.0409210813 | 0.0531837223 | 0.068193666 | 0.0625610902 | 0.055623181 | 0.0485597097 | 0.0321059302 | 0.0194827045 | 0.0216757248 | 0.0224516066 | 0.0295414473 | 0.0435774895 | 0.0500639382 | 0.0672286398 | 0.0634738078 | 0.068193666 | 0.0711529422 | 0.0598842517 | 0.0763028452 | 0.0806231857 | 0.0711529422 | 0.0598842517 | 0.0742098444 | 0.0773660484 | 0.0763028452 | 0.0886244868 | 0.0984763821 | 0.107734978 | 0.106375222 | 0.102370409 | 0.117604738 | 0.172660465 | 0.19621579 | 0.206579823 | 0.232738494 | 0.237270538 | 0.26064116 | 0.297792551 | 0.282644296 | 0.356238294 | 0.321182744 | 0.25825193 | 0.210814589 | 0.200323018 | 0.217261293 | 0.277678464 | 0.150991091 | 0.161589058 | 0.15800378 | 0.152724536 | 0.167065628 | 0.156230877 | 0.152724536 | 0.132788515 | 0.119065347 | 0.110491959 | 0.0898142109 | 0.066274206 | 0.0383975663 | 0.0360023808 | 0.0371842171 | 0.0449569559 | 0.0616586364 | 0.0653302997 | 0.0564556806 | 0.0415725461 | 0.0429006789 | 0.0500639382 | 0.0365893954 | 0.0371842171 | 0.0321059302 | 0.0191361714 | 0.0216757248 | 0.0342874705 | 0.135980453 | 0.210814589 | 0.186173419 | 0.212950925 | 0.339885368 | 0.444354489 | 0.555778247 | 0.523587665 | 0.561598013 | 0.681573721 | 0.709942929 |


* References

#+print_bibliography:
